packages/StoveOpt/StoveOpt-0.3.2.tar.gz/StoveOpt-0.3.2/StoveOpt/foamfiles/counterFlowFlame2D/case_150/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform (0 0 0.25);
    }
    primary_air
    {
        type            fixedValue;
        value           uniform (0 0 2.5);
    }    Secondary_air_RHS
    {
    type fixedValue;
    value uniform (0 150.0 0);
    }

    Secondary_air_LHS
    {
    type fixedValue;
    value uniform (0 -150.0 0);
    }

						
												  
												  
												  
												  
												   
    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
	stove_body
    {
        type            noSlip; //no slip boundary
    }
	
	
	
}


// ************************************************************************* //
